artillery/dids.yaml
config:
  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: "http://pushgateway:9091"
        tags:
          - "testId:dids"
          - "type:loadtest"


  target: "http://nodeA:1323"
  phases:
    - duration: 30
      arrivalRate: 1
      name: Warm up
    - duration: 10
      arrivalRate: 1
      rampTo: 75
      name: Ramp up load
    - duration: 600
      arrivalRate: 75
      name: Sustained load

scenarios:
  - name: "Create DIDs"
    flow:
      - post:
          url: "/internal/vdr/v1/did"